In [95]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "schools_complete.csv"
student_data_to_load = "students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [96]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [97]:
total_schools = len(school_data_complete['school_name'].unique())
total_schools

15

In [98]:
total_students = len(school_data_complete['student_name'])
total_students

39170

In [99]:
budgets = school_data_complete["budget"].unique()
budgets

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130], dtype=int64)

In [100]:
budgets_df = pd.DataFrame(budgets)
budgets_df.head()

         0
0  1910635
1  1884411
2  1056600
3  3022020
4   917500

In [101]:
#budgets_df = budgets_df.rename(
#    columns={0: "Budget"})
#budgets_df.head()

In [102]:
total_budget = budgets_df.sum()
total_budget

0    24649428
dtype: int64

In [103]:
average_math = school_data_complete['math_score'].mean()
average_math

78.98537145774827

In [104]:
average_reading = school_data_complete['reading_score'].mean()
average_reading

81.87784018381414

In [105]:
overall_passing = ((average_math + average_reading)/2)
overall_passing

80.43160582078121

In [106]:
passing_math_df = school_data_complete.loc[school_data_complete['math_score'] >= 70, :]
passing_math_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [107]:
percent_passing_math = (len(passing_math_df['student_name'])/total_students)*100
percent_passing_math

74.9808526933878

In [108]:
passing_reading_df = school_data_complete.loc[school_data_complete['reading_score'] >= 70, :]
# passing_reading_df.head()

In [109]:
percent_passing_reading = (len(passing_reading_df['student_name'])/total_students)*100
percent_passing_reading

85.80546336482001

In [110]:
# Create a dataframe to hold the above results
results_district_df = pd.DataFrame({"Total Schools" : total_schools,
                                    "Total Students": total_students,
                                    "Total Budget": total_budget,
                                    "Average Math Score": average_math,
                                    "Average Reading Score": average_reading,
                                    "% Passing Math": percent_passing_math,
                                    "% Passing Reading": percent_passing_reading,
                                    "% Overall Passing Rate": overall_passing
                                   })
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [111]:
results_district_df.dtypes

Total Schools               int64
Total Students              int64
Total Budget                int64
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [112]:
results_district_df["Total Students"] = pd.to_numeric(results_district_df["Total Students"])

results_district_df.dtypes

Total Schools               int64
Total Students              int64
Total Budget                int64
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [113]:
results_district_df["Total Students"] = results_district_df["Total Students"].astype(int).map('{0:,d}'.format)
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170",24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [114]:
results_district_df["Total Budget"] = results_district_df["Total Budget"].astype(int).map('${0:,.2f}'.format)
results_district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,80.431606

In [115]:
#school_data_complete_summary = school_data_complete[["school_name",
#                                                     "type",
#                                                     "student_name",
#                                                     "budget",
#                                                     "math_score",
#                                                     "reading_score"]]
#school_data_complete_summary.head()

In [116]:
grouped_school_summary = school_data_complete.groupby(["school_name"])
grouped_school_summary.count().head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468

In [117]:
school_type = grouped_school_summary["type"].unique()
school_type

school_name
Bailey High School       [District]
Cabrera High School       [Charter]
Figueroa High School     [District]
Ford High School         [District]
Griffin High School       [Charter]
Hernandez High School    [District]
Holden High School        [Charter]
Huang High School        [District]
Johnson High School      [District]
Pena High School          [Charter]
Rodriguez High School    [District]
Shelton High School       [Charter]
Thomas High School        [Charter]
Wilson High School        [Charter]
Wright High School        [Charter]
Name: type, dtype: object

In [152]:
total_school_students = grouped_school_summary["student_name"].count()
total_school_students

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: student_name, dtype: int64

In [119]:
total_school_budget = grouped_school_summary["budget"].unique()
total_school_budget

school_name
Bailey High School       [3124928]
Cabrera High School      [1081356]
Figueroa High School     [1884411]
Ford High School         [1763916]
Griffin High School       [917500]
Hernandez High School    [3022020]
Holden High School        [248087]
Huang High School        [1910635]
Johnson High School      [3094650]
Pena High School          [585858]
Rodriguez High School    [2547363]
Shelton High School      [1056600]
Thomas High School       [1043130]
Wilson High School       [1319574]
Wright High School       [1049400]
Name: budget, dtype: object

In [120]:
total_school_budget = total_school_budget.astype(float)
total_school_budget.dtypes

dtype('float64')

In [121]:
per_student_budget = total_school_budget / total_school_students
per_student_budget

school_name
Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [122]:
average_math_school = grouped_school_summary["math_score"].sum() / total_school_students
average_math_school

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
dtype: float64

In [123]:
average_reading_school = grouped_school_summary["reading_score"].sum() / total_school_students
average_reading_school

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
dtype: float64

In [124]:
passing_math_school = passing_math_df.groupby(["school_name"])
passing_math_school.count().head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,3318,3318,3318,3318,3318,3318,3318,3318,3318,3318
Cabrera High School,1749,1749,1749,1749,1749,1749,1749,1749,1749,1749
Figueroa High School,1946,1946,1946,1946,1946,1946,1946,1946,1946,1946
Ford High School,1871,1871,1871,1871,1871,1871,1871,1871,1871,1871
Griffin High School,1371,1371,1371,1371,1371,1371,1371,1371,1371,1371

In [125]:
percent_passing_math_school = (passing_math_school["student_name"].count()/total_school_students)*100
percent_passing_math_school

school_name
Bailey High School       66.680064
Cabrera High School      94.133477
Figueroa High School     65.988471
Ford High School         68.309602
Griffin High School      93.392371
Hernandez High School    66.752967
Holden High School       92.505855
Huang High School        65.683922
Johnson High School      66.057551
Pena High School         94.594595
Rodriguez High School    66.366592
Shelton High School      93.867121
Thomas High School       93.272171
Wilson High School       93.867718
Wright High School       93.333333
Name: student_name, dtype: float64

In [126]:
passing_reading_school = passing_reading_df.groupby(["school_name"])
passing_reading_school.count().head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,4077,4077,4077,4077,4077,4077,4077,4077,4077,4077
Cabrera High School,1803,1803,1803,1803,1803,1803,1803,1803,1803,1803
Figueroa High School,2381,2381,2381,2381,2381,2381,2381,2381,2381,2381
Ford High School,2172,2172,2172,2172,2172,2172,2172,2172,2172,2172
Griffin High School,1426,1426,1426,1426,1426,1426,1426,1426,1426,1426

In [127]:
percent_passing_reading_school = (passing_reading_school["student_name"].count()/total_school_students)*100
percent_passing_reading_school

school_name
Bailey High School       81.933280
Cabrera High School      97.039828
Figueroa High School     80.739234
Ford High School         79.299014
Griffin High School      97.138965
Hernandez High School    80.862999
Holden High School       96.252927
Huang High School        81.316421
Johnson High School      81.222432
Pena High School         95.945946
Rodriguez High School    80.220055
Shelton High School      95.854628
Thomas High School       97.308869
Wilson High School       96.539641
Wright High School       96.611111
Name: student_name, dtype: float64

In [128]:
overall_passing_school = ((percent_passing_math_school + percent_passing_reading_school)/2)
overall_passing_school

school_name
Bailey High School       74.306672
Cabrera High School      95.586652
Figueroa High School     73.363852
Ford High School         73.804308
Griffin High School      95.265668
Hernandez High School    73.807983
Holden High School       94.379391
Huang High School        73.500171
Johnson High School      73.639992
Pena High School         95.270270
Rodriguez High School    73.293323
Shelton High School      94.860875
Thomas High School       95.290520
Wilson High School       95.203679
Wright High School       94.972222
Name: student_name, dtype: float64

In [129]:
results_school_df = pd.DataFrame({"School Type": school_type,
                                  "Total Students": total_school_students,
                                  "Total School Budget": total_school_budget,
                                  "Per Student Budget": per_student_budget,
                                  "Average Math Score": average_math_school,
                                  "Average Reading Score": average_reading_school,
                                  "% Passing Math": percent_passing_math_school,
                                  "% Passing Reading": percent_passing_reading_school,
                                  "% Overall Passing Rate": overall_passing_school
                             })

results_school_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
school_name,,,,,,,,,
Bailey High School,[District],4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,[Charter],1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,[District],2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,[District],2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,[Charter],1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,95.265668

In [130]:
results_school_df.dtypes

School Type                object
Total Students              int64
Total School Budget       float64
Per Student Budget        float64
Average Math Score        float64
Average Reading Score     float64
% Passing Math            float64
% Passing Reading         float64
% Overall Passing Rate    float64
dtype: object

In [131]:
results_school_df["Total School Budget"] = results_school_df["Total School Budget"].astype(float).map('${0:,.2f}'.format)
results_school_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
school_name,,,,,,,,,
Bailey High School,[District],4976,"$3,124,928.00",628.0,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,[Charter],1858,"$1,081,356.00",582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,[District],2949,"$1,884,411.00",639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,[District],2739,"$1,763,916.00",644.0,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,[Charter],1468,"$917,500.00",625.0,83.351499,83.816757,93.392371,97.138965,95.265668

In [132]:
results_school_df["Per Student Budget"] = results_school_df["Per Student Budget"].astype(int).map('${0:,.2f}'.format)
results_school_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
school_name,,,,,,,,,
Bailey High School,[District],4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,74.306672
Cabrera High School,[Charter],1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,95.586652
Figueroa High School,[District],2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,73.363852
Ford High School,[District],2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,73.804308
Griffin High School,[Charter],1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,95.265668

In [133]:
# Sort and display the top five schools in overall passing rate
results_school_df = results_school_df.sort_values("% Overall Passing Rate", ascending=False)
results_school_df.head()

# ??????? NEED TO REMOVE BRACKETS AROUND SCHOOL TYPE

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
school_name,,,,,,,,,
Cabrera High School,[Charter],1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,95.586652
Thomas High School,[Charter],1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,95.290520
Pena High School,[Charter],962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,95.270270
Griffin High School,[Charter],1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,95.265668
Wilson High School,[Charter],2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,95.203679

In [134]:
# Sort and display the five worst-performing schools
results_school_df = results_school_df.sort_values("% Overall Passing Rate")
results_school_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
school_name,,,,,,,,,
Rodriguez High School,[District],3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,73.293323
Figueroa High School,[District],2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,73.363852
Huang High School,[District],2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,[District],4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,73.639992
Ford High School,[District],2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,73.804308

In [205]:
ninth = school_data_complete.loc[school_data_complete["grade"] == "9th", :]
ninth.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
12,12,Brittney Walker,F,9th,Huang High School,64,79,0,District,2917,1910635
13,13,William Long,M,9th,Huang High School,71,79,0,District,2917,1910635

In [206]:
ninth_index = ninth.set_index("school_name")
ninth_index.head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Huang High School,0,Paul Bradley,M,9th,66,79,0,District,2917,1910635
Huang High School,4,Bonnie Ray,F,9th,97,84,0,District,2917,1910635
Huang High School,5,Bryan Miranda,M,9th,94,94,0,District,2917,1910635
Huang High School,12,Brittney Walker,F,9th,64,79,0,District,2917,1910635
Huang High School,13,William Long,M,9th,71,79,0,District,2917,1910635

In [207]:
ninth_series = pd.Series(ninth_index["reading_score"])
ninth_series

school_name
Huang High School     66
Huang High School     97
Huang High School     94
Huang High School     64
Huang High School     71
                      ..
Thomas High School    98
Thomas High School    80
Thomas High School    79
Thomas High School    97
Thomas High School    73
Name: reading_score, Length: 11408, dtype: int64

In [138]:
grouped_ninth = ninth_series.groupby(["school_name"])
grouped_ninth.count().head()

school_name
Bailey High School      1458
Cabrera High School      528
Figueroa High School     856
Ford High School         833
Griffin High School      409
Name: reading_score, dtype: int64

In [197]:
average_grouped_ninth = grouped_ninth.sum() / grouped_ninth.count()
average_grouped_ninth

school_name
Bailey High School       81.303155
Cabrera High School      83.676136
Figueroa High School     81.198598
Ford High School         80.632653
Griffin High School      83.369193
Hernandez High School    80.866860
Holden High School       83.677165
Huang High School        81.290284
Johnson High School      81.260714
Pena High School         83.807273
Rodriguez High School    80.993127
Shelton High School      84.122642
Thomas High School       83.728850
Wilson High School       83.939778
Wright High School       83.833333
Name: reading_score, dtype: float64

In [213]:
tenth = school_data_complete.loc[school_data_complete["grade"] == "10th", :]
tenth.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635
10,10,Andrew Alexander,M,10th,Huang High School,90,70,0,District,2917,1910635
11,11,Daniel Cooper,M,10th,Huang High School,78,77,0,District,2917,1910635
14,14,Tammy Hebert,F,10th,Huang High School,85,67,0,District,2917,1910635

In [214]:
tenth_index = tenth.set_index("school_name")
tenth_index.head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Huang High School,8,Michael Roth,M,10th,95,87,0,District,2917,1910635
Huang High School,9,Matthew Greene,M,10th,96,84,0,District,2917,1910635
Huang High School,10,Andrew Alexander,M,10th,90,70,0,District,2917,1910635
Huang High School,11,Daniel Cooper,M,10th,78,77,0,District,2917,1910635
Huang High School,14,Tammy Hebert,F,10th,85,67,0,District,2917,1910635

In [141]:
tenth_series = pd.Series(reading_tenth_index["reading_score"])
tenth_series

school_name
Huang High School     95
Huang High School     96
Huang High School     90
Huang High School     78
Huang High School     85
                      ..
Thomas High School    92
Thomas High School    87
Thomas High School    70
Thomas High School    95
Thomas High School    99
Name: reading_score, Length: 10168, dtype: int64

In [142]:
grouped_tenth = tenth_series.groupby(["school_name"])
grouped_tenth.count().head()

school_name
Bailey High School      1239
Cabrera High School      466
Figueroa High School     763
Ford High School         708
Griffin High School      406
Name: reading_score, dtype: int64

In [198]:
average_grouped_tenth = grouped_tenth.sum() / grouped_tenth.count()
average_grouped_tenth

school_name
Bailey High School       80.907183
Cabrera High School      84.253219
Figueroa High School     81.408912
Ford High School         81.262712
Griffin High School      83.706897
Hernandez High School    80.660147
Holden High School       83.324561
Huang High School        81.512386
Johnson High School      80.773431
Pena High School         83.612000
Rodriguez High School    80.629808
Shelton High School      83.441964
Thomas High School       84.254157
Wilson High School       84.021452
Wright High School       83.812757
Name: reading_score, dtype: float64

In [218]:
eleventh = school_data_complete.loc[school_data_complete["grade"] == "11th", :]
eleventh.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
15,15,Dr. Jordan Carson,M,11th,Huang High School,94,88,0,District,2917,1910635
22,22,Kimberly Stewart,F,11th,Huang High School,99,84,0,District,2917,1910635
24,24,Chelsea Griffith,F,11th,Huang High School,85,73,0,District,2917,1910635
28,28,Kelly James,F,11th,Huang High School,73,55,0,District,2917,1910635

In [219]:
eleventh_index = eleventh.set_index("school_name")
eleventh_index.head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Huang High School,6,Sheena Carter,F,11th,82,80,0,District,2917,1910635
Huang High School,15,Dr. Jordan Carson,M,11th,94,88,0,District,2917,1910635
Huang High School,22,Kimberly Stewart,F,11th,99,84,0,District,2917,1910635
Huang High School,24,Chelsea Griffith,F,11th,85,73,0,District,2917,1910635
Huang High School,28,Kelly James,F,11th,73,55,0,District,2917,1910635

In [145]:
eleventh_series = pd.Series(reading_eleventh_index["reading_score"])
eleventh_series.head()

school_name
Huang High School    82
Huang High School    94
Huang High School    99
Huang High School    85
Huang High School    73
Name: reading_score, dtype: int64

In [146]:
grouped_eleventh = eleventh_series.groupby(["school_name"])
grouped_eleventh.count().head()

school_name
Bailey High School      1251
Cabrera High School      482
Figueroa High School     709
Ford High School         659
Griffin High School      361
Name: reading_score, dtype: int64

In [199]:
average_grouped_eleventh = grouped_eleventh.sum() / grouped_eleventh.count()
average_grouped_eleventh

school_name
Bailey High School       80.945643
Cabrera High School      83.788382
Figueroa High School     80.640339
Ford High School         80.403642
Griffin High School      84.288089
Hernandez High School    81.396140
Holden High School       83.815534
Huang High School        81.417476
Johnson High School      80.616027
Pena High School         84.335938
Rodriguez High School    80.864811
Shelton High School      84.373786
Thomas High School       83.585542
Wilson High School       83.764608
Wright High School       84.156322
Name: reading_score, dtype: float64

In [224]:
twelfth = school_data_complete.loc[school_data_complete["grade"] == "12th", :]
twelfth.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
7,7,Nicole Baker,F,12th,Huang High School,96,69,0,District,2917,1910635
29,29,Nicole Brown,F,12th,Huang High School,90,88,0,District,2917,1910635

In [225]:
twelfth_index = twelfth.set_index("school_name")
twelfth_index.head()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Huang High School,1,Victor Smith,M,12th,94,61,0,District,2917,1910635
Huang High School,2,Kevin Rodriguez,M,12th,90,60,0,District,2917,1910635
Huang High School,3,Dr. Richard Scott,M,12th,67,58,0,District,2917,1910635
Huang High School,7,Nicole Baker,F,12th,96,69,0,District,2917,1910635
Huang High School,29,Nicole Brown,F,12th,90,88,0,District,2917,1910635

In [226]:
twelfth_series = pd.Series(twelfth_index["reading_score"])
twelfth_series

school_name
Huang High School     94
Huang High School     90
Huang High School     67
Huang High School     96
Huang High School     90
                      ..
Thomas High School    75
Thomas High School    77
Thomas High School    91
Thomas High School    94
Thomas High School    99
Name: reading_score, Length: 7899, dtype: int64

In [193]:
grouped_twelfth = twelfth_series.groupby(["school_name"])
grouped_twelfth.sum().head()

school_name
Bailey High School      83178
Cabrera High School     32198
Figueroa High School    50540
Ford High School        43477
Griffin High School     24532
Name: reading_score, dtype: int64

In [196]:
average_grouped_twelfth = grouped_twelfth.sum() / grouped_twelfth.count()
average_grouped_twelfth

school_name
Bailey High School       80.912451
Cabrera High School      84.287958
Figueroa High School     81.384863
Ford High School         80.662338
Griffin High School      84.013699
Hernandez High School    80.857143
Holden High School       84.698795
Huang High School        80.305983
Johnson High School      81.227564
Pena High School         84.591160
Rodriguez High School    80.376426
Shelton High School      82.781671
Thomas High School       83.831361
Wilson High School       84.317673
Wright High School       84.073171
Name: reading_score, dtype: float64

In [204]:
reading_grade_df = pd.DataFrame({"9th": average_grouped_ninth, 
                                 "10th": average_grouped_tenth, 
                                 "11th": average_grouped_eleventh,
                                 "12th": average_grouped_twelfth
                                })
reading_grade_df

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

In [209]:
# math scores by grade
ninth_math_series = pd.Series(ninth_index["math_score"])
ninth_math_series

school_name
Huang High School     79
Huang High School     84
Huang High School     94
Huang High School     79
Huang High School     79
                      ..
Thomas High School    84
Thomas High School    75
Thomas High School    94
Thomas High School    76
Thomas High School    84
Name: math_score, Length: 11408, dtype: int64

In [211]:
grouped_ninth_math = ninth_math_series.groupby(["school_name"])
grouped_ninth_math.count().head()

school_name
Bailey High School      1458
Cabrera High School      528
Figueroa High School     856
Ford High School         833
Griffin High School      409
Name: math_score, dtype: int64

In [212]:
average_grouped_ninth_math = grouped_ninth_math.sum() / grouped_ninth_math.count()
average_grouped_ninth_math

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [215]:
tenth_series_math = pd.Series(tenth_index["math_score"])
tenth_series_math

school_name
Huang High School     87
Huang High School     84
Huang High School     70
Huang High School     77
Huang High School     67
                      ..
Thomas High School    98
Thomas High School    90
Thomas High School    84
Thomas High School    70
Thomas High School    90
Name: math_score, Length: 10168, dtype: int64

In [216]:
grouped_tenth_math = tenth_series_math.groupby(["school_name"])
grouped_tenth_math.count().head()

school_name
Bailey High School      1239
Cabrera High School      466
Figueroa High School     763
Ford High School         708
Griffin High School      406
Name: math_score, dtype: int64

In [217]:
average_grouped_tenth_math = grouped_tenth_math.sum() / grouped_tenth_math.count()
average_grouped_tenth_math

school_name
Bailey High School       76.996772
Cabrera High School      83.154506
Figueroa High School     76.539974
Ford High School         77.672316
Griffin High School      84.229064
Hernandez High School    77.337408
Holden High School       83.429825
Huang High School        75.908735
Johnson High School      76.691117
Pena High School         83.372000
Rodriguez High School    76.612500
Shelton High School      82.917411
Thomas High School       83.087886
Wilson High School       83.724422
Wright High School       84.010288
Name: math_score, dtype: float64

In [220]:
eleventh_series_math = pd.Series(eleventh_index["math_score"])
eleventh_series_math.head()

school_name
Huang High School    80
Huang High School    88
Huang High School    84
Huang High School    73
Huang High School    55
Name: math_score, dtype: int64

In [221]:
grouped_eleventh_math = eleventh_series_math.groupby(["school_name"])
grouped_eleventh_math.count().head()

school_name
Bailey High School      1251
Cabrera High School      482
Figueroa High School     709
Ford High School         659
Griffin High School      361
Name: math_score, dtype: int64

In [222]:
average_grouped_eleventh_math = grouped_eleventh_math.sum() / grouped_eleventh_math.count()
average_grouped_eleventh_math

school_name
Bailey High School       77.515588
Cabrera High School      82.765560
Figueroa High School     76.884344
Ford High School         76.918058
Griffin High School      83.842105
Hernandez High School    77.136029
Holden High School       85.000000
Huang High School        76.446602
Johnson High School      77.491653
Pena High School         84.328125
Rodriguez High School    76.395626
Shelton High School      83.383495
Thomas High School       83.498795
Wilson High School       83.195326
Wright High School       83.836782
Name: math_score, dtype: float64

In [227]:
twelfth_series_math = pd.Series(twelfth_index["math_score"])
twelfth_series_math

school_name
Huang High School     61
Huang High School     60
Huang High School     58
Huang High School     69
Huang High School     88
                      ..
Thomas High School    70
Thomas High School    87
Thomas High School    71
Thomas High School    77
Thomas High School    90
Name: math_score, Length: 7899, dtype: int64

In [228]:
grouped_twelfth_math = twelfth_series_math.groupby(["school_name"])
grouped_twelfth_math.sum().head()

school_name
Bailey High School      78634
Cabrera High School     31812
Figueroa High School    47911
Ford High School        41061
Griffin High School     24340
Name: math_score, dtype: int64

In [229]:
average_grouped_twelfth_math = grouped_twelfth_math.sum() / grouped_twelfth_math.count()
average_grouped_twelfth_math

school_name
Bailey High School       76.492218
Cabrera High School      83.277487
Figueroa High School     77.151369
Ford High School         76.179963
Griffin High School      83.356164
Hernandez High School    77.186567
Holden High School       82.855422
Huang High School        77.225641
Johnson High School      76.863248
Pena High School         84.121547
Rodriguez High School    77.690748
Shelton High School      83.778976
Thomas High School       83.497041
Wilson High School       83.035794
Wright High School       83.644986
Name: math_score, dtype: float64

In [230]:
math_grade_df = pd.DataFrame({"9th": average_grouped_ninth_math, 
                              "10th": average_grouped_tenth_math, 
                              "11th": average_grouped_eleventh_math,
                              "12th": average_grouped_twelfth_math
                                })
math_grade_df

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986